### Data Manipulation :

#### Using Pandas

In [101]:
import pandas as pd

In [102]:
dataset = pd.read_csv("Data.csv")

# first 4 rows
print(dataset.head(4))

          Series Region  Data_value  Suppressed STATUS    UNITS
0  BDCQ.SF1AA2CA   East    1070.874     12332.0      F  Dollars
1  BDCQ.SF1AA2CA  North    1054.408     35432.0      F  Dollars
2  BDCQ.SF1AA3CA   East    1010.665     98456.0      F  Dollars
3  BDCQ.SF1AA4CA  South    1233.700         NaN      F  Dollars

In [103]:
# Last 4 rows
print(dataset.tail(4))

          Series Region  Data_value  Suppressed STATUS    UNITS
4  BDCQ.SF1AA5CA  North    1282.436     33221.0      F  Dollars
5  BDCQ.SF1AA5CA   West    1290.820         NaN      F  Dollars
6  BDCQ.SF1AA6CA   East    1412.007     76554.0      F  Dollars
7  BDCQ.SF1AA6CA  South    1488.055     44332.0      F  Dollars

In [104]:
# Handling Missing Values
dataset.isnull().sum()

Series        0
Region        0
Data_value    0
Suppressed    2
STATUS        0
UNITS         0
dtype: int64

In [105]:
# Filling the missing values with the mean
dataset["Suppressed"] = dataset["Suppressed"].fillna(dataset["Suppressed"].mean())
dataset

          Series Region  Data_value  Suppressed STATUS    UNITS
0  BDCQ.SF1AA2CA   East    1070.874     12332.0      F  Dollars
1  BDCQ.SF1AA2CA  North    1054.408     35432.0      F  Dollars
2  BDCQ.SF1AA3CA   East    1010.665     98456.0      F  Dollars
3  BDCQ.SF1AA4CA  South    1233.700     50054.5      F  Dollars
4  BDCQ.SF1AA5CA  North    1282.436     33221.0      F  Dollars
5  BDCQ.SF1AA5CA   West    1290.820     50054.5      F  Dollars
6  BDCQ.SF1AA6CA   East    1412.007     76554.0      F  Dollars
7  BDCQ.SF1AA6CA  South    1488.055     44332.0      F  Dollars

In [106]:
# Renaming Columns
dataset = dataset.rename(columns={"Suppressed":"Price"})
dataset

          Series Region  Data_value    Price STATUS    UNITS
0  BDCQ.SF1AA2CA   East    1070.874  12332.0      F  Dollars
1  BDCQ.SF1AA2CA  North    1054.408  35432.0      F  Dollars
2  BDCQ.SF1AA3CA   East    1010.665  98456.0      F  Dollars
3  BDCQ.SF1AA4CA  South    1233.700  50054.5      F  Dollars
4  BDCQ.SF1AA5CA  North    1282.436  33221.0      F  Dollars
5  BDCQ.SF1AA5CA   West    1290.820  50054.5      F  Dollars
6  BDCQ.SF1AA6CA   East    1412.007  76554.0      F  Dollars
7  BDCQ.SF1AA6CA  South    1488.055  44332.0      F  Dollars

In [107]:
dataset.dtypes

Series            str
Region            str
Data_value    float64
Price         float64
STATUS            str
UNITS             str
dtype: object

In [108]:
# Change the datatype
dataset["Price"] = dataset["Price"].astype(int)
dataset

          Series Region  Data_value  Price STATUS    UNITS
0  BDCQ.SF1AA2CA   East    1070.874  12332      F  Dollars
1  BDCQ.SF1AA2CA  North    1054.408  35432      F  Dollars
2  BDCQ.SF1AA3CA   East    1010.665  98456      F  Dollars
3  BDCQ.SF1AA4CA  South    1233.700  50054      F  Dollars
4  BDCQ.SF1AA5CA  North    1282.436  33221      F  Dollars
5  BDCQ.SF1AA5CA   West    1290.820  50054      F  Dollars
6  BDCQ.SF1AA6CA   East    1412.007  76554      F  Dollars
7  BDCQ.SF1AA6CA  South    1488.055  44332      F  Dollars

In [109]:
# To perform a specific operation on a Column
dataset["Price in Future"] = dataset["Price"].apply(lambda x:x*3)
dataset

          Series Region  Data_value  Price STATUS    UNITS  Price in Future
0  BDCQ.SF1AA2CA   East    1070.874  12332      F  Dollars            36996
1  BDCQ.SF1AA2CA  North    1054.408  35432      F  Dollars           106296
2  BDCQ.SF1AA3CA   East    1010.665  98456      F  Dollars           295368
3  BDCQ.SF1AA4CA  South    1233.700  50054      F  Dollars           150162
4  BDCQ.SF1AA5CA  North    1282.436  33221      F  Dollars            99663
5  BDCQ.SF1AA5CA   West    1290.820  50054      F  Dollars           150162
6  BDCQ.SF1AA6CA   East    1412.007  76554      F  Dollars           229662
7  BDCQ.SF1AA6CA  South    1488.055  44332      F  Dollars           132996

In [110]:
dataset

          Series Region  Data_value  Price STATUS    UNITS  Price in Future
0  BDCQ.SF1AA2CA   East    1070.874  12332      F  Dollars            36996
1  BDCQ.SF1AA2CA  North    1054.408  35432      F  Dollars           106296
2  BDCQ.SF1AA3CA   East    1010.665  98456      F  Dollars           295368
3  BDCQ.SF1AA4CA  South    1233.700  50054      F  Dollars           150162
4  BDCQ.SF1AA5CA  North    1282.436  33221      F  Dollars            99663
5  BDCQ.SF1AA5CA   West    1290.820  50054      F  Dollars           150162
6  BDCQ.SF1AA6CA   East    1412.007  76554      F  Dollars           229662
7  BDCQ.SF1AA6CA  South    1488.055  44332      F  Dollars           132996

In [111]:
# Data Aggregrating and Grouping
grouped_mean = dataset.groupby("Series")["Price"].mean()
grouped_mean

Series
BDCQ.SF1AA2CA    23882.0
BDCQ.SF1AA3CA    98456.0
BDCQ.SF1AA4CA    50054.0
BDCQ.SF1AA5CA    41637.5
BDCQ.SF1AA6CA    60443.0
Name: Price, dtype: float64

In [112]:
grouped_sum = dataset.groupby(["Series","Region"])["Price"].sum()
grouped_sum

Series         Region
BDCQ.SF1AA2CA  East      12332
               North     35432
BDCQ.SF1AA3CA  East      98456
BDCQ.SF1AA4CA  South     50054
BDCQ.SF1AA5CA  North     33221
               West      50054
BDCQ.SF1AA6CA  East      76554
               South     44332
Name: Price, dtype: int64

In [113]:
grouped_mean1 = dataset.groupby(["Series","Region"])["Price"].mean()
grouped_mean1

Series         Region
BDCQ.SF1AA2CA  East      12332.0
               North     35432.0
BDCQ.SF1AA3CA  East      98456.0
BDCQ.SF1AA4CA  South     50054.0
BDCQ.SF1AA5CA  North     33221.0
               West      50054.0
BDCQ.SF1AA6CA  East      76554.0
               South     44332.0
Name: Price, dtype: float64

In [114]:
# Aggregrate multiple function
grouped_agg = dataset.groupby("Series")["Price"].agg(["mean","sum","count"])
grouped_agg

                  mean     sum  count
Series
BDCQ.SF1AA2CA  23882.0   47764      2
BDCQ.SF1AA3CA  98456.0   98456      1
BDCQ.SF1AA4CA  50054.0   50054      1
BDCQ.SF1AA5CA  41637.5   83275      2
BDCQ.SF1AA6CA  60443.0  120886      2

In [115]:
# Merging and Joining DataFrames
dataset1 = pd.DataFrame({'Name':["Aadarsh","Aniket","Ritesh"], "Maths's marks":[100,45,89]})
dataset2 = pd.DataFrame({'Name':["Aadarsh","Priyanshu","Ritesh"], "OOPS' marks":[100,76,67]})

In [116]:
dataset1

      Name  Maths's marks
0  Aadarsh            100
1   Aniket             45
2   Ritesh             89

In [117]:
dataset2

        Name  OOPS' marks
0    Aadarsh          100
1  Priyanshu           76
2     Ritesh           67

In [ ]:
# Merging the Dataframe on 'Name'
pd.merge(dataset1, dataset2, on = "Name", how = "inner")

      Name  Maths's marks  OOPS' marks
0  Aadarsh            100          100
1   Ritesh             89           67

In [119]:
pd.merge(dataset1, dataset2, on = "Name", how = "outer")

        Name  Maths's marks  OOPS' marks
0    Aadarsh          100.0        100.0
1     Aniket           45.0          NaN
2  Priyanshu            NaN         76.0
3     Ritesh           89.0         67.0

In [122]:
pd.merge(dataset1, dataset2, on = "Name", how = "left")

      Name  Maths's marks  OOPS' marks
0  Aadarsh            100        100.0
1   Aniket             45          NaN
2   Ritesh             89         67.0

In [123]:
pd.merge(dataset1, dataset2, on = "Name", how = "right")

        Name  Maths's marks  OOPS' marks
0    Aadarsh          100.0          100
1  Priyanshu            NaN           76
2     Ritesh           89.0           67